# coding: utf-8
#
#  Copyright (C) 2017 Noriaki TANAKA (dtana@startide.jp)
#
#  This program is free software; you can redistribute it and/or
#  modify it under the terms of the GNU General Public License as
#  published by the Free Software Foundation; either version 2 of the
#  License, or (at your option) any later version.
#
#  This program is distributed in the hope that it will be useful,
#  but WITHOUT ANY WARRANTY; without even the implied warranty of
#  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
#  General Public License for more details.
#
#  You should have received a copy of the GNU General Public License
#  along with this program; if not, write to the Free Software
#  Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA
#  02111-1307, USA.
#
# $Id: normkana.rb,v 1.2 2017/01/17 11:19:53 dtana Exp $
#
$kana_t = {
"ｦ"=>"を",
"ｧ"=>"ぁ",
"ｨ"=>"ぃ",
"ｩ"=>"ぅ",
"ｪ"=>"ぇ",
"ｫ"=>"ぉ",
"ｬ"=>"ゃ",
"ｭ"=>"ゅ",
"ｮ"=>"ょ",
"ｯ"=>"っ",
"ｰ"=>"ー",
"ｱ"=>"あ",
"ｲ"=>"い",
"ｳ"=>"う",
"ｴ"=>"え",
"ｵ"=>"お",
"ｶ"=>"か",
"ｷ"=>"き",
"ｸ"=>"く",
"ｹ"=>"け",
"ｺ"=>"こ",
"ｻ"=>"さ",
"ｼ"=>"し",
"ｽ"=>"す",
"ｾ"=>"せ",
"ｿ"=>"そ",
"ﾀ"=>"た",
"ﾁ"=>"ち",
"ﾂ"=>"つ",
"ﾃ"=>"て",
"ﾄ"=>"と",
"ﾅ"=>"な",
"ﾆ"=>"に",
"ﾇ"=>"ぬ",
"ﾈ"=>"ね",
"ﾉ"=>"の",
"ﾊ"=>"は",
"ﾋ"=>"ひ",
"ﾌ"=>"ふ",
"ﾍ"=>"へ",
"ﾎ"=>"ほ",
"ﾏ"=>"ま",
"ﾐ"=>"み",
"ﾑ"=>"む",
"ﾒ"=>"め",
"ﾓ"=>"も",
"ﾔ"=>"や",
"ﾕ"=>"ゆ",
"ﾖ"=>"よ",
"ﾗ"=>"ら",
"ﾘ"=>"り",
"ﾙ"=>"る",
"ﾚ"=>"れ",
"ﾛ"=>"ろ",
"ﾜ"=>"わ",
"ﾝ"=>"ん",
"ｶﾞ"=>"が",
"ｷﾞ"=>"ぎ",
"ｸﾞ"=>"ぐ",
"ｹﾞ"=>"げ",
"ｺﾞ"=>"ご",
"ｻﾞ"=>"ざ",
"ｼﾞ"=>"じ",
"ｽﾞ"=>"ず",
"ｾﾞ"=>"ぜ",
"ｿﾞ"=>"ぞ",
"ﾀﾞ"=>"だ",
"ﾁﾞ"=>"ぢ",
"ﾂﾞ"=>"づ",
"ﾃﾞ"=>"で",
"ﾄﾞ"=>"ど",
"ﾊﾞ"=>"ば",
"ﾋﾞ"=>"び",
"ﾌﾞ"=>"ぶ",
"ﾍﾞ"=>"べ",
"ﾎﾞ"=>"ぼ",
"ﾊﾟ"=>"ぱ",
"ﾋﾟ"=>"ぴ",
"ﾌﾟ"=>"ぷ",
"ﾍﾟ"=>"ぺ",
"ﾎﾟ"=>"ぽ",
"ﾞ"=>"゛",
"ﾟ"=>"゜",
"ヲ"=>"を",
"ァ"=>"ぁ",
"ィ"=>"ぃ",
"ゥ"=>"ぅ",
"ェ"=>"ぇ",
"ォ"=>"ぉ",
"ャ"=>"ゃ",
"ュ"=>"ゅ",
"ョ"=>"ょ",
"ッ"=>"っ",
"ー"=>"ー",
"ア"=>"あ",
"イ"=>"い",
"ウ"=>"う",
"エ"=>"え",
"オ"=>"お",
"カ"=>"か",
"キ"=>"き",
"ク"=>"く",
"ケ"=>"け",
"コ"=>"こ",
"サ"=>"さ",
"シ"=>"し",
"ス"=>"す",
"セ"=>"せ",
"ソ"=>"そ",
"タ"=>"た",
"チ"=>"ち",
"ツ"=>"つ",
"テ"=>"て",
"ト"=>"と",
"ナ"=>"な",
"ニ"=>"に",
"ヌ"=>"ぬ",
"ネ"=>"ね",
"ノ"=>"の",
"ハ"=>"は",
"ヒ"=>"ひ",
"フ"=>"ふ",
"ヘ"=>"へ",
"ホ"=>"ほ",
"マ"=>"ま",
"ミ"=>"み",
"ム"=>"む",
"メ"=>"め",
"モ"=>"も",
"ヤ"=>"や",
"ユ"=>"ゆ",
"ヨ"=>"よ",
"ラ"=>"ら",
"リ"=>"り",
"ル"=>"る",
"レ"=>"れ",
"ロ"=>"ろ",
"ワ"=>"わ",
"ン"=>"ん",
"ガ"=>"が",
"ギ"=>"ぎ",
"グ"=>"ぐ",
"ゲ"=>"げ",
"ゴ"=>"ご",
"ザ"=>"ざ",
"ジ"=>"じ",
"ズ"=>"ず",
"ゼ"=>"ぜ",
"ゾ"=>"ぞ",
"ダ"=>"だ",
"ヂ"=>"ぢ",
"ヅ"=>"づ",
"デ"=>"で",
"ド"=>"ど",
"バ"=>"ば",
"ビ"=>"び",
"ブ"=>"ぶ",
"ベ"=>"べ",
"ボ"=>"ぼ",
"パ"=>"ぱ",
"ピ"=>"ぴ",
"プ"=>"ぷ",
"ペ"=>"ぺ",
"ポ"=>"ぽ",
}

class String
    def norm_kana
        s = self.strip
        r = ''
        while s.size != 0
            t = ''
            if 2 <= s.size && (t = $kana_t[s[0,2]])
                s = s[2..-1]
            elsif t = $kana_t[s[0]]
                s = s[1..-1]
            else
                t = s[0]
                s = s[1..-1]
            end
            r += t
        end
        r
    end
end
